insert into LINE(name, color)
values ('1호선', '남색'),
       ('2호선', '초록색'),
       ('3호선', '주황색');

insert into STATION(name)
values ('까치산'),
       ('광화문'),
       ('화곡'),
       ('여의도'),
       ('오목교'),
       ('발산'),
       ('천호'),
       ('강동'),
       ('장한평'),
       ('서대문'),

       ('소요산'),
       ('동두천'),
       ('보산'),
       ('동두천중앙'),
       ('지행'),
       ('덕정'),
       ('덕계'),
       ('양주'),
       ('녹양'),
       ('가능'),

       ('구로디지털단지'),
       ('신대방'),
       ('신림'),
       ('봉천'),
       ('서울대입구'),
       ('낙성대'),
       ('방배'),
       ('사당'),
       ('서초'),
       ('교대'),

       ('대화'),
       ('주엽'),
       ('정발산'),
       ('마두'),
       ('백석'),
       ('대곡'),
       ('화정'),
       ('원당'),
       ('원흥'),
       ('삼송');

insert into SECTION(line_id, up_station_id, down_station_id, distance)
values (1, 11, 12, 777),

       (2, 23, 24, 777),
       (2, 24, 25, 777),

       (3, 36, 37, 777),
       (3, 37, 38, 777);